Tinyu-Zhao/Arduino-Boards/boards.txt
menu.UploadSpeed=Upload Speed
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On

##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

m5stack-core-esp32.name=M5Stack-Core-ESP32

m5stack-core-esp32.bootloader.tool=esptool_py
m5stack-core-esp32.bootloader.tool.default=esptool_py

m5stack-core-esp32.upload.tool=esptool_py
m5stack-core-esp32.upload.tool.default=esptool_py
m5stack-core-esp32.upload.tool.network=esp_ota

m5stack-core-esp32.upload.maximum_size=1310720
m5stack-core-esp32.upload.maximum_data_size=327680
m5stack-core-esp32.upload.flags=
m5stack-core-esp32.upload.extra_flags=

m5stack-core-esp32.serial.disableDTR=true
m5stack-core-esp32.serial.disableRTS=true

m5stack-core-esp32.build.tarch=xtensa
m5stack-core-esp32.build.bootloader_addr=0x1000
m5stack-core-esp32.build.target=esp32
m5stack-core-esp32.build.mcu=esp32
m5stack-core-esp32.build.core=esp32
m5stack-core-esp32.build.variant=m5stack_core_esp32
m5stack-core-esp32.build.board=M5Stack_Core_ESP32

m5stack-core-esp32.build.f_cpu=240000000L
m5stack-core-esp32.build.flash_size=4MB
m5stack-core-esp32.build.flash_freq=80m
m5stack-core-esp32.build.flash_mode=dio
m5stack-core-esp32.build.boot=dio
m5stack-core-esp32.build.partitions=default
m5stack-core-esp32.build.defines=
m5stack-core-esp32.build.loop_core=
m5stack-core-esp32.build.event_core=

m5stack-core-esp32.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
m5stack-core-esp32.menu.PartitionScheme.default.build.partitions=default
m5stack-core-esp32.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
m5stack-core-esp32.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
m5stack-core-esp32.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
m5stack-core-esp32.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
m5stack-core-esp32.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
m5stack-core-esp32.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
m5stack-core-esp32.menu.PartitionScheme.minimal.build.partitions=minimal
m5stack-core-esp32.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
m5stack-core-esp32.menu.PartitionScheme.no_ota.build.partitions=no_ota
m5stack-core-esp32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
m5stack-core-esp32.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
m5stack-core-esp32.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
m5stack-core-esp32.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
m5stack-core-esp32.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
m5stack-core-esp32.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
m5stack-core-esp32.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
m5stack-core-esp32.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
m5stack-core-esp32.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
m5stack-core-esp32.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
m5stack-core-esp32.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
m5stack-core-esp32.menu.PartitionScheme.huge_app.build.partitions=huge_app
m5stack-core-esp32.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
m5stack-core-esp32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
m5stack-core-esp32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
m5stack-core-esp32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
m5stack-core-esp32.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
m5stack-core-esp32.menu.PartitionScheme.fatflash.build.partitions=ffat
m5stack-core-esp32.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
m5stack-core-esp32.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
m5stack-core-esp32.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
m5stack-core-esp32.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
m5stack-core-esp32.menu.PartitionScheme.rainmaker=RainMaker
m5stack-core-esp32.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
m5stack-core-esp32.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

m5stack-core-esp32.menu.CPUFreq.240=240MHz (WiFi/BT)
m5stack-core-esp32.menu.CPUFreq.240.build.f_cpu=240000000L
m5stack-core-esp32.menu.CPUFreq.160=160MHz (WiFi/BT)
m5stack-core-esp32.menu.CPUFreq.160.build.f_cpu=160000000L
m5stack-core-esp32.menu.CPUFreq.80=80MHz (WiFi/BT)
m5stack-core-esp32.menu.CPUFreq.80.build.f_cpu=80000000L
m5stack-core-esp32.menu.CPUFreq.40=40MHz (40MHz XTAL)
m5stack-core-esp32.menu.CPUFreq.40.build.f_cpu=40000000L
m5stack-core-esp32.menu.CPUFreq.26=26MHz (26MHz XTAL)
m5stack-core-esp32.menu.CPUFreq.26.build.f_cpu=26000000L
m5stack-core-esp32.menu.CPUFreq.20=20MHz (40MHz XTAL)
m5stack-core-esp32.menu.CPUFreq.20.build.f_cpu=20000000L
m5stack-core-esp32.menu.CPUFreq.13=13MHz (26MHz XTAL)
m5stack-core-esp32.menu.CPUFreq.13.build.f_cpu=13000000L
m5stack-core-esp32.menu.CPUFreq.10=10MHz (40MHz XTAL)
m5stack-core-esp32.menu.CPUFreq.10.build.f_cpu=10000000L

m5stack-core-esp32.menu.FlashMode.qio=QIO
m5stack-core-esp32.menu.FlashMode.qio.build.flash_mode=dio
m5stack-core-esp32.menu.FlashMode.qio.build.boot=qio
m5stack-core-esp32.menu.FlashMode.dio=DIO
m5stack-core-esp32.menu.FlashMode.dio.build.flash_mode=dio
m5stack-core-esp32.menu.FlashMode.dio.build.boot=dio
m5stack-core-esp32.menu.FlashMode.qout=QOUT
m5stack-core-esp32.menu.FlashMode.qout.build.flash_mode=dout
m5stack-core-esp32.menu.FlashMode.qout.build.boot=qout
m5stack-core-esp32.menu.FlashMode.dout=DOUT
m5stack-core-esp32.menu.FlashMode.dout.build.flash_mode=dout
m5stack-core-esp32.menu.FlashMode.dout.build.boot=dout

m5stack-core-esp32.menu.FlashFreq.80=80MHz
m5stack-core-esp32.menu.FlashFreq.80.build.flash_freq=80m
m5stack-core-esp32.menu.FlashFreq.40=40MHz
m5stack-core-esp32.menu.FlashFreq.40.build.flash_freq=40m

m5stack-core-esp32.menu.FlashSize.4M=4MB (32Mb)
m5stack-core-esp32.menu.FlashSize.4M.build.flash_size=4MB
m5stack-core-esp32.menu.FlashSize.16M=16MB (128Mb)
m5stack-core-esp32.menu.FlashSize.16M.build.flash_size=16MB

