Tinyu-Zhao/Arduino-Boards/boards.txt
##############################################################

m5stick-c.name=M5Stick-C

m5stick-c.bootloader.tool=esptool_py
m5stick-c.bootloader.tool.default=esptool_py

m5stick-c.upload.tool=esptool_py
m5stick-c.upload.tool.default=esptool_py
m5stick-c.upload.tool.network=esp_ota

m5stick-c.upload.maximum_size=1310720
m5stick-c.upload.maximum_data_size=327680
m5stick-c.upload.flags=
m5stick-c.upload.extra_flags=

m5stick-c.serial.disableDTR=true
m5stick-c.serial.disableRTS=true

m5stick-c.build.tarch=xtensa
m5stick-c.build.bootloader_addr=0x1000
m5stick-c.build.target=esp32
m5stick-c.build.mcu=esp32
m5stick-c.build.core=esp32
m5stick-c.build.variant=m5stick_c
m5stick-c.build.board=M5Stick_C

m5stick-c.build.f_cpu=240000000L
m5stick-c.build.flash_size=4MB
m5stick-c.build.flash_freq=80m
m5stick-c.build.flash_mode=dio
m5stick-c.build.boot=dio
m5stick-c.build.partitions=default
m5stick-c.build.defines=

m5stick-c.menu.PartitionScheme.default=Default
m5stick-c.menu.PartitionScheme.default.build.partitions=default
m5stick-c.menu.PartitionScheme.no_ota=No OTA (Large APP)
m5stick-c.menu.PartitionScheme.no_ota.build.partitions=no_ota
m5stick-c.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
m5stick-c.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
m5stick-c.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
m5stick-c.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

m5stick-c.menu.CPUFreq.240=240MHz (WiFi/BT)
m5stick-c.menu.CPUFreq.240.build.f_cpu=240000000L
m5stick-c.menu.CPUFreq.160=160MHz (WiFi/BT)
m5stick-c.menu.CPUFreq.160.build.f_cpu=160000000L
m5stick-c.menu.CPUFreq.80=80MHz (WiFi/BT)
m5stick-c.menu.CPUFreq.80.build.f_cpu=80000000L
m5stick-c.menu.CPUFreq.40=40MHz (40MHz XTAL)
m5stick-c.menu.CPUFreq.40.build.f_cpu=40000000L
m5stick-c.menu.CPUFreq.26=26MHz (26MHz XTAL)
m5stick-c.menu.CPUFreq.26.build.f_cpu=26000000L
m5stick-c.menu.CPUFreq.20=20MHz (40MHz XTAL)
m5stick-c.menu.CPUFreq.20.build.f_cpu=20000000L
m5stick-c.menu.CPUFreq.13=13MHz (26MHz XTAL)
m5stick-c.menu.CPUFreq.13.build.f_cpu=13000000L
m5stick-c.menu.CPUFreq.10=10MHz (40MHz XTAL)
m5stick-c.menu.CPUFreq.10.build.f_cpu=10000000L

m5stick-c.menu.UploadSpeed.1500000=1500000
m5stick-c.menu.UploadSpeed.1500000.upload.speed=1500000
m5stick-c.menu.UploadSpeed.750000=750000
m5stick-c.menu.UploadSpeed.750000.upload.speed=750000
m5stick-c.menu.UploadSpeed.500000=500000
m5stick-c.menu.UploadSpeed.500000.upload.speed=500000
m5stick-c.menu.UploadSpeed.250000=250000
m5stick-c.menu.UploadSpeed.250000.upload.speed=250000
m5stick-c.menu.UploadSpeed.115200=115200
m5stick-c.menu.UploadSpeed.115200.upload.speed=115200

m5stick-c.menu.DebugLevel.none=None
m5stick-c.menu.DebugLevel.none.build.code_debug=0
m5stick-c.menu.DebugLevel.error=Error
m5stick-c.menu.DebugLevel.error.build.code_debug=1
m5stick-c.menu.DebugLevel.warn=Warn
m5stick-c.menu.DebugLevel.warn.build.code_debug=2
m5stick-c.menu.DebugLevel.info=Info
m5stick-c.menu.DebugLevel.info.build.code_debug=3
m5stick-c.menu.DebugLevel.debug=Debug
m5stick-c.menu.DebugLevel.debug.build.code_debug=4
m5stick-c.menu.DebugLevel.verbose=Verbose
m5stick-c.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

m5stick-c-plus.name=M5Stick-C-Plus

m5stick-c-plus.bootloader.tool=esptool_py
m5stick-c-plus.bootloader.tool.default=esptool_py

m5stick-c-plus.upload.tool=esptool_py
m5stick-c-plus.upload.tool.default=esptool_py
m5stick-c-plus.upload.tool.network=esp_ota

m5stick-c-plus.upload.maximum_size=1310720
m5stick-c-plus.upload.maximum_data_size=327680
m5stick-c-plus.upload.flags=
m5stick-c-plus.upload.extra_flags=

m5stick-c-plus.serial.disableDTR=true
m5stick-c-plus.serial.disableRTS=true

m5stick-c-plus.build.tarch=xtensa
m5stick-c-plus.build.bootloader_addr=0x1000
m5stick-c-plus.build.target=esp32
m5stick-c-plus.build.mcu=esp32
m5stick-c-plus.build.core=esp32
m5stick-c-plus.build.variant=m5stick_c_plus
m5stick-c-plus.build.board=M5Stick_C_PLUS

m5stick-c-plus.build.f_cpu=240000000L
m5stick-c-plus.build.flash_size=4MB
m5stick-c-plus.build.flash_freq=80m
m5stick-c-plus.build.flash_mode=dio
m5stick-c-plus.build.boot=dio
m5stick-c-plus.build.partitions=default
m5stick-c-plus.build.defines=

m5stick-c-plus.menu.PartitionScheme.default=Default
m5stick-c-plus.menu.PartitionScheme.default.build.partitions=default
m5stick-c-plus.menu.PartitionScheme.no_ota=No OTA (Large APP)
m5stick-c-plus.menu.PartitionScheme.no_ota.build.partitions=no_ota
m5stick-c-plus.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
m5stick-c-plus.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
m5stick-c-plus.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
m5stick-c-plus.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

m5stick-c-plus.menu.CPUFreq.240=240MHz (WiFi/BT)
m5stick-c-plus.menu.CPUFreq.240.build.f_cpu=240000000L
m5stick-c-plus.menu.CPUFreq.160=160MHz (WiFi/BT)
m5stick-c-plus.menu.CPUFreq.160.build.f_cpu=160000000L
m5stick-c-plus.menu.CPUFreq.80=80MHz (WiFi/BT)
m5stick-c-plus.menu.CPUFreq.80.build.f_cpu=80000000L
m5stick-c-plus.menu.CPUFreq.40=40MHz (40MHz XTAL)
m5stick-c-plus.menu.CPUFreq.40.build.f_cpu=40000000L
m5stick-c-plus.menu.CPUFreq.26=26MHz (26MHz XTAL)
m5stick-c-plus.menu.CPUFreq.26.build.f_cpu=26000000L
m5stick-c-plus.menu.CPUFreq.20=20MHz (40MHz XTAL)
m5stick-c-plus.menu.CPUFreq.20.build.f_cpu=20000000L
m5stick-c-plus.menu.CPUFreq.13=13MHz (26MHz XTAL)
m5stick-c-plus.menu.CPUFreq.13.build.f_cpu=13000000L
m5stick-c-plus.menu.CPUFreq.10=10MHz (40MHz XTAL)
m5stick-c-plus.menu.CPUFreq.10.build.f_cpu=10000000L

m5stick-c-plus.menu.UploadSpeed.1500000=1500000
m5stick-c-plus.menu.UploadSpeed.1500000.upload.speed=1500000
m5stick-c-plus.menu.UploadSpeed.750000=750000
m5stick-c-plus.menu.UploadSpeed.750000.upload.speed=750000
m5stick-c-plus.menu.UploadSpeed.500000=500000
m5stick-c-plus.menu.UploadSpeed.500000.upload.speed=500000
m5stick-c-plus.menu.UploadSpeed.250000=250000
m5stick-c-plus.menu.UploadSpeed.250000.upload.speed=250000
m5stick-c-plus.menu.UploadSpeed.115200=115200
m5stick-c-plus.menu.UploadSpeed.115200.upload.speed=115200

m5stick-c-plus.menu.DebugLevel.none=None
m5stick-c-plus.menu.DebugLevel.none.build.code_debug=0
m5stick-c-plus.menu.DebugLevel.error=Error
m5stick-c-plus.menu.DebugLevel.error.build.code_debug=1
m5stick-c-plus.menu.DebugLevel.warn=Warn
m5stick-c-plus.menu.DebugLevel.warn.build.code_debug=2
m5stick-c-plus.menu.DebugLevel.info=Info
m5stick-c-plus.menu.DebugLevel.info.build.code_debug=3
m5stick-c-plus.menu.DebugLevel.debug=Debug
m5stick-c-plus.menu.DebugLevel.debug.build.code_debug=4
m5stick-c-plus.menu.DebugLevel.verbose=Verbose
m5stick-c-plus.menu.DebugLevel.verbose.build.code_debug=5

