Tinyu-Zhao/Arduino-Boards/boards.txt
##############################################################

m5stack-atom.name=M5Stack-ATOM

m5stack-atom.bootloader.tool=esptool_py
m5stack-atom.bootloader.tool.default=esptool_py

m5stack-atom.upload.tool=esptool_py
m5stack-atom.upload.tool.default=esptool_py
m5stack-atom.upload.tool.network=esp_ota

m5stack-atom.upload.maximum_size=1310720
m5stack-atom.upload.maximum_data_size=327680
m5stack-atom.upload.flags=
m5stack-atom.upload.extra_flags=

m5stack-atom.serial.disableDTR=true
m5stack-atom.serial.disableRTS=true

m5stack-atom.build.tarch=xtensa
m5stack-atom.build.bootloader_addr=0x1000
m5stack-atom.build.target=esp32
m5stack-atom.build.mcu=esp32
m5stack-atom.build.core=esp32
m5stack-atom.build.variant=m5stack_atom
m5stack-atom.build.board=M5Stack_ATOM

m5stack-atom.build.f_cpu=240000000L
m5stack-atom.build.flash_size=4MB
m5stack-atom.build.flash_freq=80m
m5stack-atom.build.flash_mode=dio
m5stack-atom.build.boot=dio
m5stack-atom.build.partitions=default
m5stack-atom.build.defines=

m5stack-atom.menu.PartitionScheme.default=Default
m5stack-atom.menu.PartitionScheme.default.build.partitions=default
m5stack-atom.menu.PartitionScheme.no_ota=No OTA (Large APP)
m5stack-atom.menu.PartitionScheme.no_ota.build.partitions=no_ota
m5stack-atom.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
m5stack-atom.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
m5stack-atom.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
m5stack-atom.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

m5stack-atom.menu.CPUFreq.240=240MHz (WiFi/BT)
m5stack-atom.menu.CPUFreq.240.build.f_cpu=240000000L
m5stack-atom.menu.CPUFreq.160=160MHz (WiFi/BT)
m5stack-atom.menu.CPUFreq.160.build.f_cpu=160000000L
m5stack-atom.menu.CPUFreq.80=80MHz (WiFi/BT)
m5stack-atom.menu.CPUFreq.80.build.f_cpu=80000000L
m5stack-atom.menu.CPUFreq.40=40MHz (40MHz XTAL)
m5stack-atom.menu.CPUFreq.40.build.f_cpu=40000000L
m5stack-atom.menu.CPUFreq.26=26MHz (26MHz XTAL)
m5stack-atom.menu.CPUFreq.26.build.f_cpu=26000000L
m5stack-atom.menu.CPUFreq.20=20MHz (40MHz XTAL)
m5stack-atom.menu.CPUFreq.20.build.f_cpu=20000000L
m5stack-atom.menu.CPUFreq.13=13MHz (26MHz XTAL)
m5stack-atom.menu.CPUFreq.13.build.f_cpu=13000000L
m5stack-atom.menu.CPUFreq.10=10MHz (40MHz XTAL)
m5stack-atom.menu.CPUFreq.10.build.f_cpu=10000000L

m5stack-atom.menu.UploadSpeed.1500000=1500000
m5stack-atom.menu.UploadSpeed.1500000.upload.speed=1500000
m5stack-atom.menu.UploadSpeed.750000=750000
m5stack-atom.menu.UploadSpeed.750000.upload.speed=750000
m5stack-atom.menu.UploadSpeed.500000=500000
m5stack-atom.menu.UploadSpeed.500000.upload.speed=500000
m5stack-atom.menu.UploadSpeed.250000=250000
m5stack-atom.menu.UploadSpeed.250000.upload.speed=250000
m5stack-atom.menu.UploadSpeed.115200=115200
m5stack-atom.menu.UploadSpeed.115200.upload.speed=115200

m5stack-atom.menu.DebugLevel.none=None
m5stack-atom.menu.DebugLevel.none.build.code_debug=0
m5stack-atom.menu.DebugLevel.error=Error
m5stack-atom.menu.DebugLevel.error.build.code_debug=1
m5stack-atom.menu.DebugLevel.warn=Warn
m5stack-atom.menu.DebugLevel.warn.build.code_debug=2
m5stack-atom.menu.DebugLevel.info=Info
m5stack-atom.menu.DebugLevel.info.build.code_debug=3
m5stack-atom.menu.DebugLevel.debug=Debug
m5stack-atom.menu.DebugLevel.debug.build.code_debug=4
m5stack-atom.menu.DebugLevel.verbose=Verbose
m5stack-atom.menu.DebugLevel.verbose.build.code_debug=5


##############################################################

m5stack-core2.name=M5Stack-Core2

m5stack-core2.bootloader.tool=esptool_py
m5stack-core2.bootloader.tool.default=esptool_py

m5stack-core2.upload.tool=esptool_py
m5stack-core2.upload.tool.default=esptool_py
m5stack-core2.upload.tool.network=esp_ota

m5stack-core2.upload.maximum_size=1310720
m5stack-core2.upload.maximum_data_size=327680
m5stack-core2.upload.flags=
m5stack-core2.upload.extra_flags=

m5stack-core2.serial.disableDTR=true
m5stack-core2.serial.disableRTS=true

m5stack-core2.build.tarch=xtensa
m5stack-core2.build.bootloader_addr=0x1000
m5stack-core2.build.target=esp32
m5stack-core2.build.mcu=esp32
m5stack-core2.build.core=esp32
m5stack-core2.build.variant=m5stack_core2
m5stack-core2.build.board=M5STACK_Core2

m5stack-core2.build.f_cpu=240000000L
m5stack-core2.build.flash_size=16MB
m5stack-core2.build.flash_freq=80m
m5stack-core2.build.flash_mode=dio
m5stack-core2.build.boot=dio
m5stack-core2.build.partitions=default_16MB
m5stack-core2.build.defines=
m5stack-core2.build.loop_core=
m5stack-core2.build.event_core=

m5stack-core2.menu.PSRAM.enabled=Enabled
m5stack-core2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
m5stack-core2.menu.PSRAM.enabled.build.extra_libs=
m5stack-core2.menu.PSRAM.disabled=Disabled
m5stack-core2.menu.PSRAM.disabled.build.defines=
m5stack-core2.menu.PSRAM.disabled.build.extra_libs=

m5stack-core2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
m5stack-core2.menu.PartitionScheme.default.build.partitions=default
m5stack-core2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
m5stack-core2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
m5stack-core2.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
m5stack-core2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
m5stack-core2.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
m5stack-core2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
m5stack-core2.menu.PartitionScheme.minimal.build.partitions=minimal
m5stack-core2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
m5stack-core2.menu.PartitionScheme.no_ota.build.partitions=no_ota
m5stack-core2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
m5stack-core2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
m5stack-core2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
m5stack-core2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
m5stack-core2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
m5stack-core2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
m5stack-core2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
m5stack-core2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
m5stack-core2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
m5stack-core2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
m5stack-core2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
m5stack-core2.menu.PartitionScheme.huge_app.build.partitions=huge_app
m5stack-core2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
m5stack-core2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
m5stack-core2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
m5stack-core2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
m5stack-core2.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
m5stack-core2.menu.PartitionScheme.fatflash.build.partitions=ffat
m5stack-core2.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
m5stack-core2.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
m5stack-core2.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
m5stack-core2.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
m5stack-core2.menu.PartitionScheme.rainmaker=RainMaker
m5stack-core2.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
m5stack-core2.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

m5stack-core2.menu.CPUFreq.240=240MHz (WiFi/BT)
m5stack-core2.menu.CPUFreq.240.build.f_cpu=240000000L
m5stack-core2.menu.CPUFreq.160=160MHz (WiFi/BT)
m5stack-core2.menu.CPUFreq.160.build.f_cpu=160000000L
m5stack-core2.menu.CPUFreq.80=80MHz (WiFi/BT)
m5stack-core2.menu.CPUFreq.80.build.f_cpu=80000000L
m5stack-core2.menu.CPUFreq.40=40MHz (40MHz XTAL)
m5stack-core2.menu.CPUFreq.40.build.f_cpu=40000000L
m5stack-core2.menu.CPUFreq.26=26MHz (26MHz XTAL)
m5stack-core2.menu.CPUFreq.26.build.f_cpu=26000000L
m5stack-core2.menu.CPUFreq.20=20MHz (40MHz XTAL)
m5stack-core2.menu.CPUFreq.20.build.f_cpu=20000000L
m5stack-core2.menu.CPUFreq.13=13MHz (26MHz XTAL)
m5stack-core2.menu.CPUFreq.13.build.f_cpu=13000000L
m5stack-core2.menu.CPUFreq.10=10MHz (40MHz XTAL)
m5stack-core2.menu.CPUFreq.10.build.f_cpu=10000000L

m5stack-core2.menu.FlashMode.qio=QIO
m5stack-core2.menu.FlashMode.qio.build.flash_mode=dio
m5stack-core2.menu.FlashMode.qio.build.boot=qio
m5stack-core2.menu.FlashMode.dio=DIO
m5stack-core2.menu.FlashMode.dio.build.flash_mode=dio
m5stack-core2.menu.FlashMode.dio.build.boot=dio
m5stack-core2.menu.FlashMode.qout=QOUT
m5stack-core2.menu.FlashMode.qout.build.flash_mode=dout
m5stack-core2.menu.FlashMode.qout.build.boot=qout
m5stack-core2.menu.FlashMode.dout=DOUT
m5stack-core2.menu.FlashMode.dout.build.flash_mode=dout
m5stack-core2.menu.FlashMode.dout.build.boot=dout

m5stack-core2.menu.FlashFreq.80=80MHz
m5stack-core2.menu.FlashFreq.80.build.flash_freq=80m
m5stack-core2.menu.FlashFreq.40=40MHz
m5stack-core2.menu.FlashFreq.40.build.flash_freq=40m

m5stack-core2.menu.FlashSize.16M=16MB (128Mb)
m5stack-core2.menu.FlashSize.16M.build.flash_size=16MB

m5stack-core2.menu.UploadSpeed.921600=1500000
m5stack-core2.menu.UploadSpeed.921600.upload.speed=1500000
m5stack-core2.menu.UploadSpeed.921600=921600
m5stack-core2.menu.UploadSpeed.921600.upload.speed=921600
m5stack-core2.menu.UploadSpeed.115200=115200
m5stack-core2.menu.UploadSpeed.115200.upload.speed=115200
m5stack-core2.menu.UploadSpeed.256000.windows=256000
m5stack-core2.menu.UploadSpeed.256000.upload.speed=256000
m5stack-core2.menu.UploadSpeed.230400.windows.upload.speed=256000
m5stack-core2.menu.UploadSpeed.230400=230400
m5stack-core2.menu.UploadSpeed.230400.upload.speed=230400
m5stack-core2.menu.UploadSpeed.460800.linux=460800
m5stack-core2.menu.UploadSpeed.460800.macosx=460800
m5stack-core2.menu.UploadSpeed.460800.upload.speed=460800
m5stack-core2.menu.UploadSpeed.512000.windows=512000
m5stack-core2.menu.UploadSpeed.512000.upload.speed=512000

m5stack-core2.menu.LoopCore.1=Core 1
m5stack-core2.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
m5stack-core2.menu.LoopCore.0=Core 0
m5stack-core2.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

m5stack-core2.menu.EventsCore.1=Core 1
m5stack-core2.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
m5stack-core2.menu.EventsCore.0=Core 0
m5stack-core2.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

m5stack-core2.menu.DebugLevel.none=None
m5stack-core2.menu.DebugLevel.none.build.code_debug=0
m5stack-core2.menu.DebugLevel.error=Error
m5stack-core2.menu.DebugLevel.error.build.code_debug=1
m5stack-core2.menu.DebugLevel.warn=Warn
m5stack-core2.menu.DebugLevel.warn.build.code_debug=2
m5stack-core2.menu.DebugLevel.info=Info
m5stack-core2.menu.DebugLevel.info.build.code_debug=3
m5stack-core2.menu.DebugLevel.debug=Debug
m5stack-core2.menu.DebugLevel.debug.build.code_debug=4
m5stack-core2.menu.DebugLevel.verbose=Verbose
m5stack-core2.menu.DebugLevel.verbose.build.code_debug=5

